package unemp

import (
	"testing"
)

func TestUnempAllowance_CalcDailyAllowance(t *testing.T) {
	tests := []struct {
		name           string
		age            int
		totalWage      int
		expectedResult int
	}{
		{"29歳, 過去6か月の賃金総額(円): 1271520", 29, 1271520, 7064},
		{"29歳, 過去6か月の賃金総額(円): 1271880", 29, 1271880, 7065}, // 上限超え 7066 -> 7065
		{"30歳, 過去6か月の賃金総額(円): 1411920", 30, 1411920, 7844},
		{"30歳, 過去6か月の賃金総額(円): 1412280", 30, 1412280, 7845}, // 上限超え 7846 -> 7845
		{"44歳, 過去6か月の賃金総額(円): 1411920", 44, 1411920, 7844},
		{"44歳, 過去6か月の賃金総額(円): 1412280", 44, 1412280, 7845}, // 上限超え 7846 -> 7845
		{"45歳, 過去6か月の賃金総額(円): 1554120", 45, 1554120, 8634},
		{"45歳, 過去6か月の賃金総額(円): 1554480", 45, 1554480, 8635}, // 上限超え 8636 -> 8635
		{"59歳, 過去6か月の賃金総額(円): 1554120", 59, 1554120, 8634},
		{"59歳, 過去6か月の賃金総額(円): 1554480", 59, 1554480, 8635}, // 上限超え 8636 -> 8635
		{"60歳, 過去6か月の賃金総額(円): 1335420", 60, 1335420, 7419},
		{"60歳, 過去6か月の賃金総額(円): 1335780", 60, 1335780, 7420}, // 上限超え 7421 -> 7420
		{"64歳, 過去6か月の賃金総額(円): 1335420", 64, 1335420, 7419},
		{"64歳, 過去6か月の賃金総額(円): 1335780", 64, 1335780, 7420}, // 上限超え 7421 -> 7420
	}

	for _, tt := range tests {
		t.Run(tt.name, func(t *testing.T) {
			a := UnempAllowance{}
			result := a.CalcDailyAllowance(tt.age, tt.totalWage)
			if result != tt.expectedResult {
				t.Errorf("CalcDailyAllowance(%d, %d) = %d; want %d", tt.age, tt.totalWage, result, tt.expectedResult)
			}
		})
	}
}
